{"report_text": "CLINICAL HISTORY: 62-year-old female with a palpable left breast mass. Core biopsy performed under ultrasound guidance. GROSS DESCRIPTION: Received are four cores of tan-white tissue, each measuring 1.2 cm in length and 0.1 cm in diameter. MICROSCOPIC DESCRIPTION: Sections show invasive ductal carcinoma, Nottingham grade 2 (tubule score 3, nuclear grade 2, mitotic score 1, total score 6). The tumor cells are arranged in irregular nests and cords infiltrating the fibrocollagenous stroma. Ductal carcinoma in situ, cribriform type, is also present. No lymphovascular invasion identified. DIAGNOSIS: Left breast, core biopsy: Invasive ductal carcinoma, Nottingham grade 2, with associated DCIS.", "report_header": "SURGICAL PATHOLOGY REPORT", "specimen_type": "Breast, left, core biopsy", "findings": [{"description": "Invasive ductal carcinoma with irregular nests and cords infiltrating fibrocollagenous stroma", "grade": "Nottingham grade 2 (score 6/9)"}, {"description": "Ductal carcinoma in situ, cribriform type", "grade": "Not graded"}], "diagnosis": "Left breast, core biopsy: Invasive ductal carcinoma, Nottingham grade 2, with associated DCIS. No lymphovascular invasion identified."}
{"report_text": "CLINICAL HISTORY: 71-year-old male with elevated PSA of 8.2 ng/mL. Systematic 12-core prostate biopsy performed. GROSS DESCRIPTION: Received are 12 labeled cores of tan tissue, ranging from 1.0 to 1.5 cm in length. MICROSCOPIC DESCRIPTION: Cores from the right base (2 of 2) and right mid (1 of 2) show prostatic adenocarcinoma, Gleason score 3+4=7, Grade Group 2. The tumor involves approximately 40% of the submitted tissue. Small well-formed glands with poorly formed and fused glands are identified. Perineural invasion is present in the right base cores. No lymphovascular invasion identified. The remaining cores show benign prostatic tissue with focal high-grade prostatic intraepithelial neoplasia. DIAGNOSIS: Prostate, needle biopsy: Adenocarcinoma, Gleason score 3+4=7 (Grade Group 2), involving right base and right mid cores.", "report_header": "PROSTATE NEEDLE BIOPSY", "specimen_type": "Prostate, needle biopsy", "findings": [{"description": "Prostatic adenocarcinoma with well-formed, poorly formed, and fused glands in right base and right mid cores", "grade": "Gleason 3+4=7, Grade Group 2"}, {"description": "High-grade prostatic intraepithelial neoplasia in remaining cores", "grade": "N/A"}], "diagnosis": "Prostate, needle biopsy: Adenocarcinoma, Gleason score 3+4=7 (Grade Group 2), involving right base and right mid cores with perineural invasion. Approximately 40% tissue involvement."}
{"report_text": "CLINICAL HISTORY: 58-year-old female with a 1.5 cm polyp found during screening colonoscopy. GROSS DESCRIPTION: Received is a polypoid fragment of tan-pink tissue measuring 1.5 x 1.2 x 0.8 cm. The specimen is bisected and entirely submitted. MICROSCOPIC DESCRIPTION: Sections demonstrate a tubulovillous adenoma with high-grade dysplasia. The architecture shows complex branching tubules with villous features. Nuclei are enlarged, stratified, and hyperchromatic with loss of polarity. The muscularis mucosae is intact and no invasion into the submucosa is identified. The base of the polyp appears free of dysplasia. DIAGNOSIS: Colon, polypectomy: Tubulovillous adenoma with high-grade dysplasia. No invasive carcinoma identified.", "report_header": "SURGICAL PATHOLOGY - COLON POLYPECTOMY", "specimen_type": "Colon, polypectomy", "findings": [{"description": "Tubulovillous adenoma with complex branching tubules and villous features, high-grade dysplasia with enlarged hyperchromatic nuclei", "grade": "High-grade dysplasia"}], "diagnosis": "Colon, polypectomy: Tubulovillous adenoma with high-grade dysplasia. Muscularis mucosae intact. No invasive carcinoma identified. Base free of dysplasia."}
{"report_text": "CLINICAL HISTORY: 45-year-old female with a 3.2 cm right thyroid nodule. FNA was Bethesda V (suspicious for malignancy). Right thyroid lobectomy performed. GROSS DESCRIPTION: Received is a right thyroid lobectomy specimen weighing 28 grams and measuring 5.5 x 3.2 x 2.8 cm. Serial sectioning reveals a well-circumscribed, tan-white, firm nodule measuring 3.1 x 2.5 x 2.0 cm. MICROSCOPIC DESCRIPTION: Sections show a papillary thyroid carcinoma, classical variant. The tumor demonstrates papillary architecture with fibrovascular cores lined by cells with characteristic nuclear features including nuclear clearing, grooves, and intranuclear pseudoinclusions. Psammoma bodies are present. The tumor is confined to the thyroid gland with no extrathyroidal extension. Surgical margins are negative. No lymphovascular invasion is identified. DIAGNOSIS: Right thyroid lobectomy: Papillary thyroid carcinoma, classical variant, measuring 3.1 cm, confined to the thyroid, margins negative.", "report_header": "THYROID LOBECTOMY - SURGICAL PATHOLOGY", "specimen_type": "Thyroid, right, lobectomy", "findings": [{"description": "Papillary thyroid carcinoma, classical variant, with papillary architecture, nuclear clearing, grooves, pseudoinclusions, and psammoma bodies", "grade": "Well-differentiated"}], "diagnosis": "Right thyroid lobectomy: Papillary thyroid carcinoma, classical variant, 3.1 cm. Confined to the thyroid gland. No extrathyroidal extension. Margins negative. No lymphovascular invasion. pT2."}
{"report_text": "CLINICAL HISTORY: 67-year-old male with a new pigmented lesion on the upper back, clinically suspicious for melanoma. Excisional biopsy performed. GROSS DESCRIPTION: Received is an ellipse of skin measuring 2.5 x 1.5 x 0.6 cm with a central dark brown to black asymmetric macule measuring 1.2 x 0.9 cm. The specimen is serially sectioned and entirely submitted. MICROSCOPIC DESCRIPTION: Sections show malignant melanoma, superficial spreading type. The melanoma has a Breslow thickness of 1.8 mm with ulceration present. Clark level IV invasion into the reticular dermis is noted. The mitotic rate is 3 per mm2. No lymphovascular invasion or perineural invasion is identified. Deep and peripheral margins are negative with a closest margin of 0.4 cm. No microsatellitosis. Tumor-infiltrating lymphocytes are brisk. DIAGNOSIS: Skin, upper back, excisional biopsy: Malignant melanoma, superficial spreading type, Breslow thickness 1.8 mm, ulcerated, pT2b.", "report_header": "SKIN EXCISION - DERMATOPATHOLOGY", "specimen_type": "Skin, upper back, excisional biopsy", "findings": [{"description": "Malignant melanoma, superficial spreading type, Breslow thickness 1.8 mm, ulcerated, Clark level IV, mitotic rate 3/mm2, brisk TILs", "grade": "pT2b"}], "diagnosis": "Skin, upper back, excisional biopsy: Malignant melanoma, superficial spreading type, Breslow thickness 1.8 mm, ulcerated, pT2b. Margins negative. No lymphovascular or perineural invasion. No microsatellitosis."}
{"report_text": "CLINICAL HISTORY: 55-year-old male with persistent cough and a 2.8 cm right upper lobe mass on CT. Bronchoscopic biopsy performed. GROSS DESCRIPTION: Received are multiple fragments of tan-white tissue aggregating 0.8 x 0.5 x 0.3 cm. MICROSCOPIC DESCRIPTION: Sections demonstrate non-small cell carcinoma consistent with squamous cell carcinoma. The tumor cells form nests with keratinization and intercellular bridges. Central necrosis is present within tumor nests. The cells show large, pleomorphic nuclei with prominent nucleoli. No glandular differentiation is identified. Immunohistochemistry shows the tumor cells are positive for p40 and CK5/6, and negative for TTF-1 and napsin A. DIAGNOSIS: Lung, right upper lobe, bronchoscopic biopsy: Squamous cell carcinoma, moderately differentiated.", "report_header": "BRONCHOSCOPIC BIOPSY - LUNG", "specimen_type": "Lung, right upper lobe, bronchoscopic biopsy", "findings": [{"description": "Squamous cell carcinoma with keratinization, intercellular bridges, central necrosis, and pleomorphic nuclei; p40+, CK5/6+, TTF-1-, napsin A-", "grade": "Moderately differentiated"}], "diagnosis": "Lung, right upper lobe, bronchoscopic biopsy: Squamous cell carcinoma, moderately differentiated. Immunohistochemistry profile consistent with squamous differentiation (p40+, CK5/6+, TTF-1-, napsin A-)."}
{"report_text": "CLINICAL HISTORY: 73-year-old male with hematuria. Transurethral resection of a bladder tumor performed. GROSS DESCRIPTION: Received are multiple fragments of tan-pink to hemorrhagic tissue aggregating 3.5 x 2.5 x 1.0 cm. MICROSCOPIC DESCRIPTION: Sections show high-grade papillary urothelial carcinoma. The tumor demonstrates papillary architecture with branching fibrovascular cores lined by markedly atypical urothelial cells showing loss of polarity, nuclear pleomorphism, and frequent mitotic figures including atypical forms. Invasion into the lamina propria (muscularis mucosae) is identified. No muscularis propria (detrusor muscle) is present in the specimen for evaluation. No lymphovascular invasion is identified in the sections examined. DIAGNOSIS: Urinary bladder, transurethral resection: High-grade papillary urothelial carcinoma, invasive into lamina propria (pT1). Muscularis propria not present for evaluation.", "report_header": "TURBT SPECIMEN - BLADDER", "specimen_type": "Urinary bladder, transurethral resection", "findings": [{"description": "High-grade papillary urothelial carcinoma with marked cytologic atypia, loss of polarity, and frequent mitoses; invasive into lamina propria", "grade": "High-grade, pT1"}], "diagnosis": "Urinary bladder, transurethral resection: High-grade papillary urothelial carcinoma, invasive into lamina propria (pT1). No muscularis propria present for evaluation. No lymphovascular invasion identified."}
{"report_text": "CLINICAL HISTORY: 40-year-old female with recurrent cervical dysplasia. Loop electrosurgical excision procedure (LEEP) performed. GROSS DESCRIPTION: Received is a LEEP specimen measuring 2.2 x 1.8 x 1.0 cm. The mucosal surface shows a focal area of pallor measuring 0.6 cm. The specimen is serially sectioned and entirely submitted in 6 cassettes. MICROSCOPIC DESCRIPTION: Sections demonstrate cervical intraepithelial neoplasia, grade 3 (CIN 3, carcinoma in situ). Full-thickness dysplastic squamous epithelium with loss of maturation, nuclear atypia, and frequent mitotic figures is present. The transformation zone is entirely represented. The endocervical and ectocervical margins are negative for dysplasia. No invasive carcinoma is identified. Koilocytic changes are not a prominent feature. DIAGNOSIS: Cervix, LEEP: Cervical intraepithelial neoplasia, grade 3 (CIN 3). All margins negative.", "report_header": "CERVICAL LEEP SPECIMEN", "specimen_type": "Cervix, LEEP excision", "findings": [{"description": "Cervical intraepithelial neoplasia, grade 3 with full-thickness dysplastic squamous epithelium, nuclear atypia, and frequent mitoses", "grade": "CIN 3 (carcinoma in situ)"}], "diagnosis": "Cervix, LEEP: Cervical intraepithelial neoplasia, grade 3 (CIN 3, carcinoma in situ). All margins (endocervical and ectocervical) negative. No invasive carcinoma identified."}
