{"report_text": "INDICATION: 58-year-old male with chronic cough and weight loss. COMPARISON: CT chest dated 2024-01-15. TECHNIQUE: CT of the chest performed with intravenous contrast using a pulmonary embolism protocol. FINDINGS: There is a 2.3 cm spiculated nodule in the right upper lobe, increased from 1.8 cm on prior study. Mediastinal lymphadenopathy is present with the largest node measuring 1.5 cm in the subcarinal station. No pleural effusion. The heart is normal in size. IMPRESSION: Right upper lobe spiculated nodule increased in size, suspicious for primary lung malignancy. Recommend tissue sampling.", "report_header": "CT CHEST WITH CONTRAST", "exam_type": "CT Chest", "findings": [{"anatomy": "Right upper lobe", "observation": "spiculated nodule", "severity": "moderate"}, {"anatomy": "Mediastinum, subcarinal station", "observation": "lymphadenopathy", "severity": "mild"}], "impressions": "Right upper lobe spiculated nodule increased in size from 1.8 cm to 2.3 cm, suspicious for primary lung malignancy. Mediastinal lymphadenopathy. Recommend tissue sampling."}
{"report_text": "INDICATION: 42-year-old female with new onset seizures. COMPARISON: None. TECHNIQUE: MRI of the brain performed with and without gadolinium contrast on a 3T scanner. Sequences include T1, T2, FLAIR, DWI, and post-contrast T1. FINDINGS: There is a 1.8 x 1.5 cm ring-enhancing lesion in the left temporal lobe with surrounding vasogenic edema. No midline shift. The ventricles are normal in size and configuration. No acute hemorrhage or restricted diffusion. Remaining brain parenchyma appears unremarkable. IMPRESSION: Ring-enhancing lesion in the left temporal lobe with surrounding edema. Differential includes metastasis, high-grade glioma, or abscess. Recommend neurosurgical consultation.", "report_header": "MRI BRAIN WITH AND WITHOUT CONTRAST", "exam_type": "MRI Brain", "findings": [{"anatomy": "Left temporal lobe", "observation": "ring-enhancing lesion", "severity": "moderate"}, {"anatomy": "Left temporal lobe", "observation": "vasogenic edema", "severity": "mild"}], "impressions": "Ring-enhancing lesion in the left temporal lobe measuring 1.8 x 1.5 cm with surrounding vasogenic edema. Differential diagnosis includes metastasis, high-grade glioma, or abscess. Recommend neurosurgical consultation."}
{"report_text": "INDICATION: 72-year-old male with acute right-sided weakness. COMPARISON: None available. TECHNIQUE: Non-contrast CT of the head performed as a stroke protocol. FINDINGS: There is a hyperdense area in the left basal ganglia measuring approximately 3.2 x 2.8 cm consistent with acute hemorrhage. Surrounding edema is noted with mild mass effect on the left lateral ventricle. No midline shift. No evidence of hydrocephalus. Calvarium is intact. IMPRESSION: Acute left basal ganglia hemorrhage with mild mass effect. No midline shift. Clinical correlation and neurosurgical consultation recommended.", "report_header": "CT HEAD WITHOUT CONTRAST", "exam_type": "CT Head", "findings": [{"anatomy": "Left basal ganglia", "observation": "acute hemorrhage", "severity": "severe"}, {"anatomy": "Left lateral ventricle", "observation": "mild mass effect", "severity": "mild"}], "impressions": "Acute left basal ganglia hemorrhage measuring 3.2 x 2.8 cm with mild mass effect on the left lateral ventricle. No midline shift or hydrocephalus. Neurosurgical consultation recommended."}
{"report_text": "INDICATION: 35-year-old female with right lower quadrant pain, rule out appendicitis. COMPARISON: None. TECHNIQUE: CT of the abdomen and pelvis performed with intravenous and oral contrast. FINDINGS: The appendix is dilated to 11 mm in diameter with wall enhancement and periappendiceal fat stranding. A small appendicolith is seen at the appendiceal base. There is a small amount of free fluid in the pelvis. No abscess formation identified. The liver, spleen, kidneys, and pancreas are unremarkable. No bowel obstruction. IMPRESSION: Findings consistent with acute uncomplicated appendicitis. Surgical consultation recommended.", "report_header": "CT ABDOMEN AND PELVIS WITH CONTRAST", "exam_type": "CT Abdomen Pelvis", "findings": [{"anatomy": "Appendix", "observation": "dilated appendix with wall enhancement", "severity": "moderate"}, {"anatomy": "Periappendiceal region", "observation": "fat stranding", "severity": "mild"}, {"anatomy": "Pelvis", "observation": "small free fluid", "severity": "mild"}], "impressions": "Acute uncomplicated appendicitis with dilated appendix measuring 11 mm, periappendiceal fat stranding, and appendicolith. Small amount of pelvic free fluid. Surgical consultation recommended."}
{"report_text": "INDICATION: 65-year-old male with low back pain radiating to the left leg. COMPARISON: MRI lumbar spine dated 2023-09-20. TECHNIQUE: MRI of the lumbar spine without contrast on a 1.5T scanner. Sequences include sagittal T1, T2, STIR, and axial T2. FINDINGS: At L4-L5, there is a left paracentral disc herniation measuring 8 mm, causing moderate left lateral recess stenosis and impingement of the traversing left L5 nerve root. Moderate facet arthropathy is noted at L4-L5 and L5-S1. Mild disc desiccation at L3-L4 through L5-S1. The conus terminates normally at L1. No compression fractures identified. IMPRESSION: Left paracentral disc herniation at L4-L5 with left L5 nerve root impingement. Moderate facet arthropathy at L4-L5 and L5-S1.", "report_header": "MRI LUMBAR SPINE WITHOUT CONTRAST", "exam_type": "MRI Lumbar Spine", "findings": [{"anatomy": "L4-L5 disc", "observation": "left paracentral disc herniation", "severity": "moderate"}, {"anatomy": "Left L5 nerve root", "observation": "nerve root impingement", "severity": "moderate"}, {"anatomy": "L4-L5 and L5-S1 facet joints", "observation": "facet arthropathy", "severity": "moderate"}], "impressions": "Left paracentral disc herniation at L4-L5 measuring 8 mm with moderate left lateral recess stenosis and impingement of the traversing left L5 nerve root. Moderate facet arthropathy at L4-L5 and L5-S1."}
{"report_text": "INDICATION: 50-year-old female with shortness of breath and chest pain. COMPARISON: Chest X-ray dated 2024-05-01. TECHNIQUE: PA and lateral chest radiograph. FINDINGS: The cardiac silhouette is mildly enlarged. There is bilateral perihilar vascular congestion with cephalization of pulmonary vessels. Small bilateral pleural effusions are present, left greater than right. No focal consolidation or pneumothorax. Mild interstitial edema is noted. Osseous structures are unremarkable. IMPRESSION: Cardiomegaly with bilateral pulmonary vascular congestion and small bilateral pleural effusions, consistent with congestive heart failure.", "report_header": "CHEST X-RAY PA AND LATERAL", "exam_type": "X-ray Chest", "findings": [{"anatomy": "Heart", "observation": "cardiomegaly", "severity": "mild"}, {"anatomy": "Bilateral perihilar region", "observation": "vascular congestion", "severity": "moderate"}, {"anatomy": "Bilateral pleural spaces", "observation": "pleural effusions", "severity": "mild"}], "impressions": "Cardiomegaly with bilateral perihilar vascular congestion and cephalization. Small bilateral pleural effusions, left greater than right. Findings consistent with congestive heart failure."}
{"report_text": "INDICATION: 28-year-old male with right knee pain after sports injury. COMPARISON: None. TECHNIQUE: MRI of the right knee without contrast on a 3T scanner. Sequences include sagittal PD fat-saturated, coronal T2, and axial PD. FINDINGS: There is a complete tear of the anterior cruciate ligament with associated bone marrow edema in the lateral femoral condyle and posterolateral tibial plateau consistent with a pivot-shift mechanism. The medial meniscus demonstrates a horizontal tear in the posterior horn. The lateral meniscus is intact. The medial and lateral collateral ligaments are intact. Moderate joint effusion is present. IMPRESSION: Complete ACL tear with bone bruise pattern consistent with pivot-shift injury. Horizontal tear of the posterior horn of the medial meniscus. Moderate joint effusion.", "report_header": "MRI RIGHT KNEE WITHOUT CONTRAST", "exam_type": "MRI Knee", "findings": [{"anatomy": "Anterior cruciate ligament", "observation": "complete tear", "severity": "severe"}, {"anatomy": "Lateral femoral condyle and posterolateral tibial plateau", "observation": "bone marrow edema", "severity": "moderate"}, {"anatomy": "Medial meniscus, posterior horn", "observation": "horizontal tear", "severity": "moderate"}, {"anatomy": "Right knee joint", "observation": "joint effusion", "severity": "moderate"}], "impressions": "Complete ACL tear with bone bruise pattern consistent with pivot-shift injury mechanism. Horizontal tear of the posterior horn of the medial meniscus. Moderate joint effusion."}
{"report_text": "INDICATION: 68-year-old female with abdominal pain and jaundice. COMPARISON: Ultrasound abdomen dated 2024-06-10 showing gallstones. TECHNIQUE: Ultrasound of the right upper quadrant with color Doppler. FINDINGS: The gallbladder is distended and demonstrates wall thickening to 5 mm with pericholecystic fluid. Multiple shadowing gallstones are present, the largest measuring 1.2 cm. A positive sonographic Murphy sign was elicited during the examination. The common bile duct measures 9 mm, which is mildly dilated. The intrahepatic bile ducts are not dilated. The liver parenchyma is homogeneous without focal lesions. IMPRESSION: Acute cholecystitis with gallstones and mildly dilated common bile duct. Surgical consultation recommended.", "report_header": "ULTRASOUND RIGHT UPPER QUADRANT", "exam_type": "Ultrasound Abdomen", "findings": [{"anatomy": "Gallbladder", "observation": "wall thickening with pericholecystic fluid", "severity": "moderate"}, {"anatomy": "Gallbladder", "observation": "gallstones", "severity": "moderate"}, {"anatomy": "Common bile duct", "observation": "mild dilatation", "severity": "mild"}], "impressions": "Acute cholecystitis with gallbladder wall thickening, pericholecystic fluid, and multiple gallstones. Mildly dilated common bile duct measuring 9 mm. Surgical consultation recommended."}
{"report_text": "INDICATION: 55-year-old male with history of hepatocellular carcinoma, surveillance scan. COMPARISON: MRI liver dated 2024-02-28. TECHNIQUE: MRI of the abdomen with Eovist (gadoxetic acid) contrast on a 3T scanner. Dynamic post-contrast sequences obtained. FINDINGS: Previously identified 2.5 cm lesion in hepatic segment VI now measures 3.1 cm, demonstrating arterial hyperenhancement with washout on portal venous and delayed phases, consistent with viable hepatocellular carcinoma. A new 1.0 cm arterially enhancing lesion is seen in segment III with washout, meeting LI-RADS 5 criteria. The portal vein is patent without thrombus. No ascites. IMPRESSION: Growing hepatocellular carcinoma in segment VI, now 3.1 cm. New LI-RADS 5 lesion in segment III. Recommend multidisciplinary tumor board discussion.", "report_header": "MRI ABDOMEN WITH EOVIST CONTRAST", "exam_type": "MRI Abdomen", "findings": [{"anatomy": "Hepatic segment VI", "observation": "hepatocellular carcinoma, interval growth", "severity": "severe"}, {"anatomy": "Hepatic segment III", "observation": "new arterially enhancing lesion, LI-RADS 5", "severity": "severe"}], "impressions": "Growing hepatocellular carcinoma in segment VI increased from 2.5 cm to 3.1 cm. New 1.0 cm LI-RADS 5 lesion in segment III concerning for additional hepatocellular carcinoma. Recommend multidisciplinary tumor board discussion."}
{"report_text": "INDICATION: 45-year-old female with left breast mass found on screening mammography. COMPARISON: Mammogram dated 2024-03-15. TECHNIQUE: Targeted ultrasound of the left breast. FINDINGS: In the left breast at 2 o'clock position, 5 cm from the nipple, there is an irregular hypoechoic mass measuring 1.4 x 1.0 x 0.9 cm with angular margins and posterior acoustic shadowing. No internal vascularity demonstrated on color Doppler. Two morphologically normal-appearing lymph nodes are seen in the left axilla. No skin thickening or retraction. IMPRESSION: Suspicious irregular solid mass in the left breast at 2 o'clock, BI-RADS 4C. Recommend ultrasound-guided core needle biopsy.", "report_header": "ULTRASOUND LEFT BREAST TARGETED", "exam_type": "Ultrasound Breast", "findings": [{"anatomy": "Left breast, 2 o'clock position", "observation": "irregular hypoechoic mass with angular margins", "severity": "moderate"}, {"anatomy": "Left axilla", "observation": "morphologically normal lymph nodes", "severity": "none"}], "impressions": "Suspicious irregular solid mass in the left breast at 2 o'clock position measuring 1.4 x 1.0 x 0.9 cm with posterior acoustic shadowing, classified as BI-RADS 4C. Recommend ultrasound-guided core needle biopsy."}
